; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite2 - satellite
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	thermograph4 - mode
	thermograph2 - mode
	thermograph0 - mode
	image1 - mode
	thermograph3 - mode
	GroundStation11 - direction
	Star27 - direction
	GroundStation47 - direction
	GroundStation38 - direction
	GroundStation19 - direction
	Star45 - direction
	Star26 - direction
	GroundStation14 - direction
	Star17 - direction
	GroundStation42 - direction
	GroundStation15 - direction
	GroundStation16 - direction
	Star0 - direction
	Star18 - direction
	Star8 - direction
	Star20 - direction
	GroundStation5 - direction
	GroundStation33 - direction
	Star28 - direction
	Star23 - direction
	Star39 - direction
	Star30 - direction
	Star49 - direction
	GroundStation6 - direction
	Star35 - direction
	Star3 - direction
	Star22 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	GroundStation48 - direction
	Star25 - direction
	GroundStation10 - direction
	GroundStation44 - direction
	Star40 - direction
	Star4 - direction
	Star34 - direction
	GroundStation13 - direction
	Star37 - direction
	GroundStation21 - direction
	GroundStation31 - direction
	GroundStation12 - direction
	Star32 - direction
	Star36 - direction
	Star29 - direction
	GroundStation46 - direction
	Star9 - direction
	Star1 - direction
	GroundStation41 - direction
	GroundStation43 - direction
	GroundStation24 - direction
	Planet50 - direction
	Planet51 - direction
	Phenomenon52 - direction
	Phenomenon53 - direction
	Phenomenon54 - direction
	Phenomenon55 - direction
	Phenomenon56 - direction
	Planet57 - direction
	Star58 - direction
	Planet59 - direction
	Phenomenon60 - direction
	Phenomenon61 - direction
	Phenomenon62 - direction
	Planet63 - direction
	Star64 - direction
	Star65 - direction
	Phenomenon66 - direction
	Star67 - direction
	Star68 - direction
	Planet69 - direction
	Phenomenon70 - direction
	Phenomenon71 - direction
	Star72 - direction
	Star73 - direction
	Planet74 - direction
	Planet75 - direction
	Star76 - direction
	Phenomenon77 - direction
	Planet78 - direction
	Planet79 - direction
	Star80 - direction
	Phenomenon81 - direction
	Star82 - direction
	Star83 - direction
	Star84 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 Star36)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star37)
	(calibration_target instrument0 Star20)
	(calibration_target instrument0 GroundStation46)
	(calibration_target instrument0 GroundStation44)
	(calibration_target instrument0 GroundStation33)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star40)
	(calibration_target instrument0 Star17)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star29)
	(calibration_target instrument0 GroundStation16)
	(calibration_target instrument0 Star22)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star39)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star32)
	(calibration_target instrument1 Star45)
	(calibration_target instrument1 GroundStation44)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star30)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation38)
	(calibration_target instrument1 Star36)
	(calibration_target instrument1 Star29)
	(supports instrument2 image1)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation46)
	(calibration_target instrument2 GroundStation48)
	(calibration_target instrument2 GroundStation15)
	(calibration_target instrument2 GroundStation24)
	(calibration_target instrument2 GroundStation31)
	(calibration_target instrument2 Star39)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph4)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation33)
	(calibration_target instrument3 Star28)
	(calibration_target instrument3 Star36)
	(calibration_target instrument3 Star17)
	(calibration_target instrument3 GroundStation31)
	(calibration_target instrument3 GroundStation14)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star32)
	(calibration_target instrument3 Star26)
	(calibration_target instrument3 GroundStation41)
	(calibration_target instrument3 Star40)
	(calibration_target instrument3 GroundStation48)
	(calibration_target instrument3 Star45)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 GroundStation19)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument4 thermograph0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation15)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star0)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 Star30)
	(calibration_target instrument5 Star23)
	(calibration_target instrument5 Star39)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 Star28)
	(calibration_target instrument5 GroundStation42)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star17)
	(calibration_target instrument5 GroundStation33)
	(supports instrument6 thermograph4)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation16)
	(calibration_target instrument6 Star35)
	(calibration_target instrument6 GroundStation15)
	(calibration_target instrument6 GroundStation33)
	(calibration_target instrument6 GroundStation43)
	(calibration_target instrument6 Star32)
	(calibration_target instrument6 GroundStation44)
	(calibration_target instrument6 GroundStation48)
	(calibration_target instrument6 GroundStation13)
	(supports instrument7 thermograph3)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation12)
	(calibration_target instrument7 GroundStation21)
	(calibration_target instrument7 Star29)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 GroundStation48)
	(calibration_target instrument7 Star39)
	(calibration_target instrument7 GroundStation41)
	(calibration_target instrument7 Star20)
	(calibration_target instrument7 GroundStation7)
	(calibration_target instrument7 Star30)
	(calibration_target instrument7 Star8)
	(calibration_target instrument7 Star18)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 Star9)
	(calibration_target instrument7 Star28)
	(calibration_target instrument7 GroundStation16)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star28)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 Star22)
	(calibration_target instrument8 GroundStation10)
	(calibration_target instrument8 Star37)
	(calibration_target instrument8 Star39)
	(calibration_target instrument8 Star23)
	(calibration_target instrument8 Star40)
	(calibration_target instrument8 Star28)
	(calibration_target instrument8 Star25)
	(calibration_target instrument8 GroundStation33)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star34)
	(supports instrument9 thermograph4)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 Star1)
	(calibration_target instrument9 Star49)
	(calibration_target instrument9 Star37)
	(calibration_target instrument9 Star36)
	(calibration_target instrument9 Star22)
	(calibration_target instrument9 Star32)
	(calibration_target instrument9 Star30)
	(supports instrument10 thermograph3)
	(supports instrument10 thermograph4)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 GroundStation2)
	(calibration_target instrument10 Star22)
	(calibration_target instrument10 Star3)
	(calibration_target instrument10 GroundStation10)
	(calibration_target instrument10 Star36)
	(calibration_target instrument10 Star35)
	(calibration_target instrument10 GroundStation6)
	(calibration_target instrument10 Star25)
	(calibration_target instrument10 Star32)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star37)
	(supports instrument11 thermograph4)
	(supports instrument11 image1)
	(calibration_target instrument11 GroundStation12)
	(calibration_target instrument11 Star25)
	(calibration_target instrument11 GroundStation48)
	(calibration_target instrument11 GroundStation7)
	(calibration_target instrument11 GroundStation2)
	(supports instrument12 image1)
	(supports instrument12 thermograph4)
	(calibration_target instrument12 Star36)
	(calibration_target instrument12 Star32)
	(calibration_target instrument12 GroundStation12)
	(calibration_target instrument12 GroundStation31)
	(calibration_target instrument12 GroundStation21)
	(calibration_target instrument12 Star37)
	(calibration_target instrument12 GroundStation13)
	(calibration_target instrument12 Star34)
	(calibration_target instrument12 Star4)
	(calibration_target instrument12 Star40)
	(calibration_target instrument12 GroundStation44)
	(calibration_target instrument12 GroundStation10)
	(supports instrument13 image1)
	(calibration_target instrument13 GroundStation41)
	(calibration_target instrument13 Star1)
	(calibration_target instrument13 Star9)
	(calibration_target instrument13 GroundStation46)
	(calibration_target instrument13 Star29)
	(calibration_target instrument13 GroundStation24)
	(supports instrument14 thermograph4)
	(supports instrument14 thermograph0)
	(supports instrument14 image1)
	(calibration_target instrument14 GroundStation24)
	(calibration_target instrument14 GroundStation43)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(on_board instrument14 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation7)
)
(:goal (and
	(pointing satellite0 Star25)
	(pointing satellite3 Planet69)
	(pointing satellite4 GroundStation13)
	(have_image Planet50 thermograph3)
	(have_image Planet51 image1)
	(have_image Phenomenon52 thermograph0)
	(have_image Phenomenon53 image1)
	(have_image Phenomenon54 thermograph2)
	(have_image Phenomenon55 image1)
	(have_image Phenomenon56 thermograph3)
	(have_image Planet57 thermograph4)
	(have_image Star58 thermograph3)
	(have_image Planet59 thermograph2)
	(have_image Phenomenon60 image1)
	(have_image Phenomenon61 thermograph3)
	(have_image Phenomenon62 thermograph2)
	(have_image Planet63 thermograph2)
	(have_image Star64 image1)
	(have_image Star65 thermograph3)
	(have_image Phenomenon66 thermograph3)
	(have_image Star67 thermograph0)
	(have_image Star68 thermograph0)
	(have_image Planet69 image1)
	(have_image Phenomenon70 thermograph2)
	(have_image Phenomenon71 image1)
	(have_image Star72 thermograph0)
	(have_image Star73 thermograph4)
	(have_image Planet74 thermograph2)
	(have_image Planet75 thermograph3)
	(have_image Star76 thermograph0)
	(have_image Phenomenon77 image1)
	(have_image Planet78 thermograph4)
	(have_image Planet79 thermograph3)
	(have_image Star80 thermograph0)
	(have_image Phenomenon81 image1)
	(have_image Star82 thermograph4)
	(have_image Star83 thermograph0)
	(have_image Star84 thermograph3)
))

)

; plan
1. (switch_on instrument11 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument11)
   goals met: 0 of 38
2. (calibrate satellite4 instrument11 groundstation7)
   added: (calibrated instrument11)
   goals met: 0 of 38
3. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 38
4. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 0 of 38
5. (calibrate satellite3 instrument9 star37)
   added: (calibrated instrument9)
   goals met: 0 of 38
6. (calibrate satellite1 instrument5 star28)
   added: (calibrated instrument5)
   goals met: 0 of 38
7. (turn_to satellite4 groundstation13 groundstation7)
   deleted: (pointing satellite4 groundstation7)
   added: (pointing satellite4 groundstation13)
   goals met: 1 of 38
8. (turn_to satellite3 phenomenon54 star37)
   deleted: (pointing satellite3 star37)
   added: (pointing satellite3 phenomenon54)
   goals met: 1 of 38
9. (take_image satellite3 phenomenon54 instrument9 thermograph2)
   added: (have_image phenomenon54 thermograph2)
   goals met: 2 of 38
10. (turn_to satellite3 phenomenon56 phenomenon54)
   deleted: (pointing satellite3 phenomenon54)
   added: (pointing satellite3 phenomenon56)
   goals met: 2 of 38
11. (take_image satellite3 phenomenon56 instrument9 thermograph3)
   added: (have_image phenomenon56 thermograph3)
   goals met: 3 of 38
12. (turn_to satellite3 phenomenon61 phenomenon56)
   deleted: (pointing satellite3 phenomenon56)
   added: (pointing satellite3 phenomenon61)
   goals met: 3 of 38
13. (take_image satellite3 phenomenon61 instrument9 thermograph3)
   added: (have_image phenomenon61 thermograph3)
   goals met: 4 of 38
14. (turn_to satellite3 phenomenon62 phenomenon61)
   deleted: (pointing satellite3 phenomenon61)
   added: (pointing satellite3 phenomenon62)
   goals met: 4 of 38
15. (take_image satellite3 phenomenon62 instrument9 thermograph2)
   added: (have_image phenomenon62 thermograph2)
   goals met: 5 of 38
16. (turn_to satellite3 phenomenon66 phenomenon62)
   deleted: (pointing satellite3 phenomenon62)
   added: (pointing satellite3 phenomenon66)
   goals met: 5 of 38
17. (take_image satellite3 phenomenon66 instrument9 thermograph3)
   added: (have_image phenomenon66 thermograph3)
   goals met: 6 of 38
18. (turn_to satellite3 phenomenon70 phenomenon66)
   deleted: (pointing satellite3 phenomenon66)
   added: (pointing satellite3 phenomenon70)
   goals met: 6 of 38
19. (take_image satellite3 phenomenon70 instrument9 thermograph2)
   added: (have_image phenomenon70 thermograph2)
   goals met: 7 of 38
20. (turn_to satellite3 planet50 phenomenon70)
   deleted: (pointing satellite3 phenomenon70)
   added: (pointing satellite3 planet50)
   goals met: 7 of 38
21. (take_image satellite3 planet50 instrument9 thermograph3)
   added: (have_image planet50 thermograph3)
   goals met: 8 of 38
22. (turn_to satellite3 planet59 planet50)
   deleted: (pointing satellite3 planet50)
   added: (pointing satellite3 planet59)
   goals met: 8 of 38
23. (take_image satellite3 planet59 instrument9 thermograph2)
   added: (have_image planet59 thermograph2)
   goals met: 9 of 38
24. (turn_to satellite3 planet63 planet59)
   deleted: (pointing satellite3 planet59)
   added: (pointing satellite3 planet63)
   goals met: 9 of 38
25. (take_image satellite3 planet63 instrument9 thermograph2)
   added: (have_image planet63 thermograph2)
   goals met: 10 of 38
26. (turn_to satellite3 planet69 planet63)
   deleted: (pointing satellite3 planet63)
   added: (pointing satellite3 planet69)
   goals met: 11 of 38
27. (turn_to satellite1 phenomenon52 star28)
   deleted: (pointing satellite1 star28)
   added: (pointing satellite1 phenomenon52)
   goals met: 11 of 38
28. (take_image satellite1 phenomenon52 instrument5 thermograph0)
   added: (have_image phenomenon52 thermograph0)
   goals met: 12 of 38
29. (turn_to satellite1 star67 phenomenon52)
   deleted: (pointing satellite1 phenomenon52)
   added: (pointing satellite1 star67)
   goals met: 12 of 38
30. (take_image satellite1 star67 instrument5 thermograph0)
   added: (have_image star67 thermograph0)
   goals met: 13 of 38
31. (turn_to satellite1 star68 star67)
   deleted: (pointing satellite1 star67)
   added: (pointing satellite1 star68)
   goals met: 13 of 38
32. (take_image satellite1 star68 instrument5 thermograph0)
   added: (have_image star68 thermograph0)
   goals met: 14 of 38
33. (turn_to satellite1 star72 star68)
   deleted: (pointing satellite1 star68)
   added: (pointing satellite1 star72)
   goals met: 14 of 38
34. (take_image satellite1 star72 instrument5 thermograph0)
   added: (have_image star72 thermograph0)
   goals met: 15 of 38
35. (turn_to satellite1 star76 star72)
   deleted: (pointing satellite1 star72)
   added: (pointing satellite1 star76)
   goals met: 15 of 38
36. (take_image satellite1 star76 instrument5 thermograph0)
   added: (have_image star76 thermograph0)
   goals met: 16 of 38
37. (turn_to satellite1 star80 star76)
   deleted: (pointing satellite1 star76)
   added: (pointing satellite1 star80)
   goals met: 16 of 38
38. (take_image satellite1 star80 instrument5 thermograph0)
   added: (have_image star80 thermograph0)
   goals met: 17 of 38
39. (turn_to satellite1 star83 star80)
   deleted: (pointing satellite1 star80)
   added: (pointing satellite1 star83)
   goals met: 17 of 38
40. (take_image satellite1 star83 instrument5 thermograph0)
   added: (have_image star83 thermograph0)
   goals met: 18 of 38
41. (turn_to satellite0 star25 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star25)
   goals met: 19 of 38
42. (turn_to satellite4 phenomenon53 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 phenomenon53)
   goals met: 18 of 38
43. (take_image satellite4 phenomenon53 instrument11 image1)
   added: (have_image phenomenon53 image1)
   goals met: 19 of 38
44. (turn_to satellite4 groundstation13 phenomenon53)
   deleted: (pointing satellite4 phenomenon53)
   added: (pointing satellite4 groundstation13)
   goals met: 20 of 38
45. (turn_to satellite4 phenomenon55 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 phenomenon55)
   goals met: 19 of 38
46. (take_image satellite4 phenomenon55 instrument11 image1)
   added: (have_image phenomenon55 image1)
   goals met: 20 of 38
47. (turn_to satellite4 groundstation13 phenomenon55)
   deleted: (pointing satellite4 phenomenon55)
   added: (pointing satellite4 groundstation13)
   goals met: 21 of 38
48. (turn_to satellite4 phenomenon60 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 phenomenon60)
   goals met: 20 of 38
49. (take_image satellite4 phenomenon60 instrument11 image1)
   added: (have_image phenomenon60 image1)
   goals met: 21 of 38
50. (turn_to satellite4 groundstation13 phenomenon60)
   deleted: (pointing satellite4 phenomenon60)
   added: (pointing satellite4 groundstation13)
   goals met: 22 of 38
51. (turn_to satellite4 phenomenon71 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 phenomenon71)
   goals met: 21 of 38
52. (take_image satellite4 phenomenon71 instrument11 image1)
   added: (have_image phenomenon71 image1)
   goals met: 22 of 38
53. (turn_to satellite4 groundstation13 phenomenon71)
   deleted: (pointing satellite4 phenomenon71)
   added: (pointing satellite4 groundstation13)
   goals met: 23 of 38
54. (turn_to satellite4 phenomenon77 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 phenomenon77)
   goals met: 22 of 38
55. (take_image satellite4 phenomenon77 instrument11 image1)
   added: (have_image phenomenon77 image1)
   goals met: 23 of 38
56. (turn_to satellite4 groundstation13 phenomenon77)
   deleted: (pointing satellite4 phenomenon77)
   added: (pointing satellite4 groundstation13)
   goals met: 24 of 38
57. (turn_to satellite4 phenomenon81 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 phenomenon81)
   goals met: 23 of 38
58. (take_image satellite4 phenomenon81 instrument11 image1)
   added: (have_image phenomenon81 image1)
   goals met: 24 of 38
59. (turn_to satellite4 groundstation13 phenomenon81)
   deleted: (pointing satellite4 phenomenon81)
   added: (pointing satellite4 groundstation13)
   goals met: 25 of 38
60. (turn_to satellite4 planet51 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 planet51)
   goals met: 24 of 38
61. (take_image satellite4 planet51 instrument11 image1)
   added: (have_image planet51 image1)
   goals met: 25 of 38
62. (turn_to satellite4 groundstation13 planet51)
   deleted: (pointing satellite4 planet51)
   added: (pointing satellite4 groundstation13)
   goals met: 26 of 38
63. (turn_to satellite4 planet57 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 planet57)
   goals met: 25 of 38
64. (take_image satellite4 planet57 instrument11 thermograph4)
   added: (have_image planet57 thermograph4)
   goals met: 26 of 38
65. (turn_to satellite4 groundstation13 planet57)
   deleted: (pointing satellite4 planet57)
   added: (pointing satellite4 groundstation13)
   goals met: 27 of 38
66. (turn_to satellite4 planet69 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 planet69)
   goals met: 26 of 38
67. (take_image satellite4 planet69 instrument11 image1)
   added: (have_image planet69 image1)
   goals met: 27 of 38
68. (turn_to satellite4 groundstation13 planet69)
   deleted: (pointing satellite4 planet69)
   added: (pointing satellite4 groundstation13)
   goals met: 28 of 38
69. (turn_to satellite4 planet78 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 planet78)
   goals met: 27 of 38
70. (take_image satellite4 planet78 instrument11 thermograph4)
   added: (have_image planet78 thermograph4)
   goals met: 28 of 38
71. (turn_to satellite4 groundstation13 planet78)
   deleted: (pointing satellite4 planet78)
   added: (pointing satellite4 groundstation13)
   goals met: 29 of 38
72. (turn_to satellite4 star64 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 star64)
   goals met: 28 of 38
73. (take_image satellite4 star64 instrument11 image1)
   added: (have_image star64 image1)
   goals met: 29 of 38
74. (turn_to satellite4 groundstation13 star64)
   deleted: (pointing satellite4 star64)
   added: (pointing satellite4 groundstation13)
   goals met: 30 of 38
75. (turn_to satellite4 star73 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 star73)
   goals met: 29 of 38
76. (take_image satellite4 star73 instrument11 thermograph4)
   added: (have_image star73 thermograph4)
   goals met: 30 of 38
77. (turn_to satellite4 groundstation13 star73)
   deleted: (pointing satellite4 star73)
   added: (pointing satellite4 groundstation13)
   goals met: 31 of 38
78. (turn_to satellite4 star82 groundstation13)
   deleted: (pointing satellite4 groundstation13)
   added: (pointing satellite4 star82)
   goals met: 30 of 38
79. (take_image satellite4 star82 instrument11 thermograph4)
   added: (have_image star82 thermograph4)
   goals met: 31 of 38
80. (turn_to satellite4 groundstation13 star82)
   deleted: (pointing satellite4 star82)
   added: (pointing satellite4 groundstation13)
   goals met: 32 of 38
81. (turn_to satellite3 planet74 planet69)
   deleted: (pointing satellite3 planet69)
   added: (pointing satellite3 planet74)
   goals met: 31 of 38
82. (take_image satellite3 planet74 instrument9 thermograph2)
   added: (have_image planet74 thermograph2)
   goals met: 32 of 38
83. (turn_to satellite3 planet69 planet74)
   deleted: (pointing satellite3 planet74)
   added: (pointing satellite3 planet69)
   goals met: 33 of 38
84. (turn_to satellite3 planet75 planet69)
   deleted: (pointing satellite3 planet69)
   added: (pointing satellite3 planet75)
   goals met: 32 of 38
85. (take_image satellite3 planet75 instrument9 thermograph3)
   added: (have_image planet75 thermograph3)
   goals met: 33 of 38
86. (turn_to satellite3 planet69 planet75)
   deleted: (pointing satellite3 planet75)
   added: (pointing satellite3 planet69)
   goals met: 34 of 38
87. (turn_to satellite3 planet79 planet69)
   deleted: (pointing satellite3 planet69)
   added: (pointing satellite3 planet79)
   goals met: 33 of 38
88. (take_image satellite3 planet79 instrument9 thermograph3)
   added: (have_image planet79 thermograph3)
   goals met: 34 of 38
89. (turn_to satellite3 planet69 planet79)
   deleted: (pointing satellite3 planet79)
   added: (pointing satellite3 planet69)
   goals met: 35 of 38
90. (turn_to satellite3 star58 planet69)
   deleted: (pointing satellite3 planet69)
   added: (pointing satellite3 star58)
   goals met: 34 of 38
91. (take_image satellite3 star58 instrument9 thermograph3)
   added: (have_image star58 thermograph3)
   goals met: 35 of 38
92. (turn_to satellite3 planet69 star58)
   deleted: (pointing satellite3 star58)
   added: (pointing satellite3 planet69)
   goals met: 36 of 38
93. (turn_to satellite3 star65 planet69)
   deleted: (pointing satellite3 planet69)
   added: (pointing satellite3 star65)
   goals met: 35 of 38
94. (take_image satellite3 star65 instrument9 thermograph3)
   added: (have_image star65 thermograph3)
   goals met: 36 of 38
95. (turn_to satellite3 planet69 star65)
   deleted: (pointing satellite3 star65)
   added: (pointing satellite3 planet69)
   goals met: 37 of 38
96. (turn_to satellite3 star84 planet69)
   deleted: (pointing satellite3 planet69)
   added: (pointing satellite3 star84)
   goals met: 36 of 38
97. (take_image satellite3 star84 instrument9 thermograph3)
   added: (have_image star84 thermograph3)
   goals met: 37 of 38
98. (turn_to satellite3 planet69 star84)
   deleted: (pointing satellite3 star84)
   added: (pointing satellite3 planet69)
   goals met: 38 of 38
